Repository: bemot/gogandmagog
Catalog: translation/translation-omegat.tmx
Source language: en_us
Languages: uk

source: They did not repent of their fornications.
uk: Вони не покаялися у своїх блудах.

source: They did not repent of their thefts.
uk: У своїх крадіжках не розкаялися.

source: They don't believe in Jesus Christ.
uk: Вони не вірять в Ісуса Христа.

source: They don't even follow their Old Testament.
uk: Вони навіть не дотримуються свого Старого Завіту.

source: They don't wanna live a righteous life.
uk: Вони не хочуть жити праведним життям.

source: They dwell safely, dwelling without walls, having neither bars nor gates.
uk: Вони живуть безпечно, живуть без стін, не маючи ані засувів, ані воріт.

source: They end up, the bones start connecting to one another.
uk: Вони закінчуються, кістки починають з’єднуватися одна з одною.

source: They get hail here?
uk: У них тут град?

source: They hate his rules.
uk: Вони ненавидять його правила.

source: They have this big wall that separates them from Palestine.
uk: Вони мають велику стіну, яка відділяє їх від Палестини.

source: They literally think that this battle of Gog and Magog is about to happen, that we're lining up for it right now.
uk: Вони буквально думають, що ця битва Ґоґа та Маґоґа ось-ось відбудеться, що ми зараз шикуємося до неї.

source: They looked forward to the cross.
uk: Вони з нетерпінням чекали хреста.

source: They think that's the enemy because they get confused.
uk: Вони думають, що це ворог, тому що заплутуються.

source: They wanna do wickedly and it's gonna be a clean kingdom and they don't like cleanliness.
uk: Вони хочуть чинити зло, і це буде чисте королівство, і їм не подобається чистота.

source: They wanna get involved in debauchery and wickedness.
uk: Вони хочуть втягнутися в розпусту і зло.

source: They were totally separate.
uk: Вони були абсолютно окремо.

source: They're all thrown into Lake of Fire.
uk: Їх усіх кидають у Вогняне озеро.

source: They're done.
uk: Вони готові.

source: They're going to be resurrected, brought back to life.
uk: Вони воскреснуть, повернуться до життя.

source: They're going to kill each other.
uk: Вони збираються вбити один одного.

source: They're gonna be caught up.
uk: Їх наздоженуть.

source: They're gonna be in heaven with us for a few years.
uk: Вони будуть з нами на небесах кілька років.

source: They're gonna be stealing and robbing and kill.
uk: Вони будуть красти, грабувати і вбивати.

source: They're gonna come back to life, right?
uk: Вони повернуться до життя, правда?

source: They're gonna go toward designing ways to grow food more efficiently.
uk: Вони збираються розробити способи більш ефективного вирощування їжі.

source: They're gonna have to create so many weapons.
uk: Їм доведеться створити стільки зброї.

source: They're gonna have to get organized.
uk: Їм доведеться організуватися.

source: They're gonna have to get their weapons together.
uk: Їм доведеться зібрати зброю разом.

source: They're gonna keep finding weapons and burning them and reusing them for things, recycling.
uk: Вони продовжуватимуть знаходити зброю, спалювати її та повторно використовувати для чогось, переробляти.

source: They're gonna live in Israel and they're gonna be judged by the 12 apostles, right?
uk: Вони житимуть в Ізраїлі, і їх судитимуть 12 апостолів, чи не так?

source: They're not worried about somebody breaking in or anything because the crime is gonna be so low and there hasn't been a war in so long.
uk: Вони не хвилюються, що хтось вторгнеться чи що-небудь ще, тому що злочинність буде дуже низькою, а війни так давно не було.

source: They're obviously blocks of ice, right?
uk: Очевидно, це брили льоду, чи не так?

source: They're over, right?
uk: Вони закінчилися, правда?

source: They're over.
uk: Вони закінчилися.

source: They're still murdering during that time and they're still committing theft.
uk: Протягом цього часу вони все ще вбивають і все ще скоюють крадіжки.

source: They're surrounding the city, they think they're gonna go up, and they, oh, these people don't know how to fight, they don't have weapons, they're not, they're defenseless, but then they get there, there's confusion, they start killing each other, and the next thing you know, God starts raining giant hail stones out of heaven.
uk: Вони оточують місто, думають, що підуть, а вони, ой, ці люди не вміють воювати, у них немає зброї, вони не мають, вони беззахисні, а потім вони потрапляють туди, виникає плутанина, вони починають вбивати один одного, і наступне, що ви знаєте, Бог починає сипати з небес гігантський град.

source: They've ended.
uk: Вони закінчилися.

source: They've expired.
uk: Термін їх дії закінчився.

source: Think about Saddam Hussein and the Gulf War.
uk: Подумайте про Саддама Хусейна та війну в Перській затоці.

source: This is back when I was a very young man and he was a Christian and he went to a non-denominational church in the area, but he was saved and I was talking to him and he was one of the managers and we were having a good conversation about the things of God.
uk: Це було ще тоді, коли я був дуже молодим чоловіком, і він був християнином, і він пішов до неконфесійної церкви в цьому районі, але його врятували, і я розмовляв з ним, і він був одним із менеджерів, і ми мали хороша розмова про Боже.

source: This is the part that throws people for a loop.
uk: Це частина, яка кидає людей в петлю.

source: Those that believe in a pre-tribulation rapture, those that are into Zionism and John Hagee and the TV preachers and pretty much the whole Bible prophecy section at the Christian bookstore, what they're gonna teach is that this is all about 1948 when Israel went back to the land and they got their country in 1948.
uk: Тих, хто вірить у піднесення до скорботи, тих, хто захоплюється сіонізмом, Джоном Хагі та телевізійними проповідниками та практично всім відділом біблійних пророцтв у християнській книжковій крамниці, вони будуть вчити, що це все про 1948 рік, коли Ізраїль повернулися на землю, і вони отримали свою країну в 1948 році.

source: Thou and all thy bands and many people with thee.
uk: Ти і всі твої групи, і багато людей з тобою.

source: Thou shalt ascend and come like a storm.
uk: Ти піднімешся і прийдеш, як буря.

source: Thou shalt be like a cloud to cover the land.
uk: Ти станеш, як хмара, щоб землю покрити.

source: Thousand year millennial reign of Christ.
uk: Тисячолітнє тисячолітнє правління Христа.

source: Thus saith the Lord God, it shall also come to pass that at the same time things shall come into thy mind and thou shalt think an evil thought and thou shalt say, I will go up to the land of unwalled villages.
uk: Так говорить Господь Бог, станеться також, що в той самий час щось прийде тобі на думку, і ти подумаєш про злу думку, і ти скажеш: Я піду в край неогороджених сіл.

source: Verse 22, and I will make them one nation in the land upon the mountains of Israel, and one king shall be king to them all, they shall be no more two nations, neither shall they be divided into two kingdoms at all, any more at all.
uk: Вірш 22, і Я зроблю їх одним народом у землі на Ізраїлевих горах, і один цар буде царем для всіх них, вони більше не будуть двома народами, і вони більше не будуть поділені на два царства взагалі, більше взагалі.

source: Verse 25, they shall dwell in the land that I've given unto Jacob my servant, wherein your fathers have dwelt, and they shall dwell therein, even they, and their children, and their children's children forever, and my servant David shall be their prince forever.
uk: Вірш 25, вони житимуть на землі, яку Я дав Якову, Моєму рабові, де сиділи ваші батьки, і вони житимуть на ній, навіть вони, їхні діти та діти їхніх синів навіки, а Мій раб Давид буде їхній князь навіки.

source: Wars break out after a military buildup that takes place for a long time.
uk: Війни спалахують після нарощування військової сили, яка триває тривалий час.

source: We can win, we can do this.
uk: Ми можемо перемогти, ми можемо це зробити.

source: We didn't even need them in this battle.
uk: Вони нам навіть не були потрібні в цій битві.

source: We didn't even need them.
uk: Вони нам навіть не були потрібні.

source: We don't know if they're the size of a fist, or a baseball, what's the biggest hail you've ever heard of?
uk: Ми не знаємо, чи вони розміром з кулак, чи з бейсбольний м'яч, про який найбільший град ви коли-небудь чули?

source: We don't need these tanks, there's no war.
uk: Нам ці танки не потрібні, війни немає.

source: We don't need these weapons.
uk: Нам ця зброя не потрібна.

source: We don't really know.
uk: Ми насправді не знаємо.

source: We look back on the cross, but they were still saved by the blood of Jesus.
uk: Ми оглядаємося на хрест, але вони все одно були врятовані кров’ю Ісуса.

source: We'll get some details about the millennium.
uk: Ми отримаємо деякі подробиці про тисячоліття.

source: We're gonna go back to Ezekiel and get some End Times Bible Prophecy from that book.
uk: Ми повернемося до Єзекіїля і візьмемо біблійне пророцтво останніх часів із цієї книги.

source: We're gonna go up there and attack them because it's just unwalled villages.
uk: Ми піднімемося туди й атакуємо їх, тому що це просто села без стін.

source: We're gonna just take them by storm because they're completely unprotected, completely unprepared for an attack.
uk: Ми просто візьмемо їх штурмом, тому що вони абсолютно незахищені, абсолютно не готові до нападу.

source: We're just gonna burn these wooden weapons.
uk: Ми просто спалимо цю дерев'яну зброю.

source: We're not in year 999.
uk: Ми не в 999 році.

source: We're talking about Jesus because Jesus is the son of David.
uk: Ми говоримо про Ісуса, тому що Ісус є сином Давида.

source: Well, Jesus told his 12 apostles.
uk: Ну, Ісус сказав своїм 12 апостолам.

source: Well, a lot of times in the Old Testament, when there's a battle where the children of Israel are severely outnumbered, and these are times in the history of the children of Israel where they're doing right before the Lord, and when they're doing right before the Lord, he protects them, he takes care of them, and so when they're right in the sight of God, and some giant enemy comes against them, whether it be the army of the Ethiopians at one point, whether it be the armies of the Philistines, or whether it's the armies of the Amorites, or the Hittites, or whatever the heathen nation that comes against them, to fight against them, what God would often do, because in their own strength, they were just unable to win that battle.
uk: Ну, багато разів у Старому Завіті, коли відбувається битва, де діти Ізраїля сильно переважають чисельністю, і це часи в історії дітей Ізраїлю, коли вони чинили справедливо перед Господом, і коли вони роблячи праведне перед Господом, він захищає їх, піклується про них, і тому, коли вони праві в очах Бога, і якийсь величезний ворог виступає проти них, чи то армія ефіопів в один момент, чи то армії филистимлян, чи це армії амореян, чи хеттів, чи будь-яка інша поганська нація, яка виступає проти них, щоб воювати проти них, що Бог часто робив, тому що у своїй власній силі вони просто не змогли виграти цю битву.

source: Well, during the millennium, that industry is gonna stop because there's a thousand years of peace.
uk: Що ж, протягом тисячоліття ця індустрія зупиниться, тому що буде тисяча років миру.

source: Well, here's the detail.
uk: Ну, ось деталь.

source: Well, here's the practical application.
uk: Ну, ось практичне застосування.

source: Well, in Ezekiel, we have the exact same timeline, right?
uk: Ну, в Єзекіїля ми маємо точно таку ж хронологію, чи не так?

source: Well, let me ask you this.
uk: Ну, дозвольте запитати вас про це.

source: Well, of course they do live.
uk: Ну, звичайно, живуть.

source: Well, that's why he told us, okay, go back and look up Gog and Magog, get the details.
uk: Ну, тому він сказав нам, гаразд, поверніться і подивіться на Гога і Магога, дізнайтеся подробиці.

source: Well, then here's what I'd say to you.
uk: Ну, тоді ось що я тобі скажу.

source: Well, then let me ask you this, did Jesus start ruling over them in 1948?
uk: Ну, тоді дозвольте запитати вас, чи Ісус почав правити ними в 1948 році?

source: Well, what that is is a clue to you to go back to the book of Ezekiel to get more detail about that since he only gave it a couple of verses because there's only one other place in the whole Bible that mentions Gog and Magog and that's back in Ezekiel chapter 38.
uk: Що ж, що це таке, для вас ключ до розгадки щоб повернутися до книги Єзекіїля щоб отримати більш детальну інформацію про це Оскільки він дав їй лише пару віршів тому що в усій Біблії є лише одне місце в якому згадуються Гог і Маґоґ і це ще в 38-му розділі книги Єзекіїля.

source: Well, what would happen is, he would create a spirit of confusion where the Edomites might get mixed up and think that the Moabites are the enemy.
uk: Ну, що станеться, він створить дух замішання, де едомляни можуть заплутатися й подумати, що моавітяни є ворогом.

source: Well, where I'm from in Sacramento, every once in a while you get severe hail, and I know places like Texas, they get even more hail and bigger hail, but I know that in Sacramento, the car dealers would run a big promotional and they'd say, hail sale, we're going to sell you hail damaged vehicles.
uk: Ну, там, де я родом із Сакраменто, час від часу випадає сильний град, і я знаю, що в таких місцях, як Техас, там випадає ще більше і сильніший град, але я знаю, що в Сакраменто дилери автомобілів влаштують великий рекламні, і вони сказали б, розпродаж, ми збираємося продати вам автомобілі, пошкоджені градом.

source: Well, yeah, but I mean it's the fifth, it says November 6th, so it's expired.
uk: Ну, так, але я маю на увазі, що це п’яте, там написано 6 листопада, тому термін дії минув.

source: Well, you know, don't you wanna know a little more about that battle?
uk: Ну, знаєте, чи не хочете ви дізнатися трохи більше про ту битву?

source: Well, you know, is Ethiopia arming itself for this?
uk: Ну, знаєте, Ефіопія для цього озброюється?

source: Well, you say, well, it's just figurative, okay.
uk: Ну, ви скажете, ну, це образно, добре.

source: What does that mean?
uk: Що це означає?

source: What if you're in the millennial reign of Christ and it's been peace for a thousand years?
uk: Що, якщо ви перебуваєте в тисячолітньому правлінні Христа, і протягом тисячі років панує мир?

source: What that represents is taking weapons and using them for agriculture.
uk: Це означає взяти зброю та використовувати її для сільського господарства.

source: What the Lord would sometimes do is he would send a spirit of confusion into the camp of the enemy, whether that was the Edomites, or the Moabites, or whatever the enemy.
uk: Те, що Господь іноді робив, це посилав дух сум'яття в табір ворога, чи то були едомляни, чи моавітяни, чи будь-який інший ворог.

source: What this is clearly talking about is in the millennium.
uk: Те, про що це явно говорить, знаходиться в міленіумі.

source: When in reality, they're allied against Israel, he'd cause just confusion in the ranks where they just start just, you know, ah, you know, just start slaying whoever's around them.
uk: Коли насправді вони об’єдналися проти Ізраїлю, він просто спричинив би замішання в рядах, де вони тільки почали просто, знаєте, ах, знаєте, просто почали вбивати всіх, хто навколо них.

source: When you accidentally kill the guy that's on your team.
uk: Коли ти випадково вбиваєш хлопця з твоєї команди.

source: Who knows that song?
uk: Хто знає цю пісню?

source: Who's ever seen a picture of that wall that they have in Jerusalem?
uk: Хто коли-небудь бачив зображення тієї стіни, що є в Єрусалимі?

source: Why?
uk: чому

source: World War I, you had a couple of decades of buildup leading up to that.
uk: Перша світова війна, у вас було кілька десятиліть нарощування, що призвело до цього.

source: Yeah, they lived in reign of Christ, thousand years.
uk: Так, вони жили під час правління Христа, тисячу років.

source: You better have a weapon during that time.
uk: На цей час вам краще мати зброю.

source: You got Gog and Magog and then you got the white throne.
uk: У вас є Гог і Магог, а потім ви отримали білий трон.

source: You got a thousand year reign of Christ.
uk: Ви отримали тисячолітнє правління Христа.

source: You got new heaven and new earth.
uk: Ви отримали нове небо і нову землю.

source: You gotta check it off.
uk: Ви повинні поставити галочку.

source: You gotta wait a little longer, folks, sorry.
uk: Вам доведеться ще трохи почекати, люди, вибачте.

source: You heard that song before?
uk: Ви чули цю пісню раніше?

source: You know what I'm saying?
uk: Ви знаєте, що я кажу?

source: You know why?
uk: Знаєш чому?

source: You know, I mean, it just kinda clicked with me because it's not really that complicated.
uk: Знаєте, я маю на увазі, мені це просто сподобалося, тому що насправді це не так складно.

source: You know, Saddam Hussein is building up, building up to that, building up to that.
uk: Ви знаєте, Саддам Хусейн розвивається, розвивається до цього, розвивається до цього.

source: You know, have any of these prime ministers or presidents that they've had over there in that nation of Israel been anything like David?
uk: Ви знаєте, хтось із цих прем’єр-міністрів чи президентів, які були там у тій країні Ізраїлю, був чимось схожим на Давида?

source: You know, if you don't really care that much how it looks, if there's a little bit of a dent or a ding on the hood, they'll sell it to you for a little bit cheaper, right?
uk: Знаєте, якщо вам не дуже байдуже, як це виглядає, якщо на капоті є невелика вм’ятина чи вм’ятина, вони продадуть вам це трохи дешевше, чи не так?

source: You know, is Libya prepared?
uk: Знаєте, чи готова Лівія?

source: You know, it took about five or six years to build up to World War II.
uk: Ви знаєте, на будівництво до Другої світової війни пішло п’ять-шість років.

source: You know, make sure you have, and it's okay to read it out of order, read it in whatever order you want.
uk: Ви знаєте, переконайтеся, що у вас є, і це нормально читати це без порядку, читати це в будь-якому порядку, який ви хочете.

source: You know, no matter how good things are, certain wicked people, they're just never gonna be happy, they're never gonna be satisfied.
uk: Ви знаєте, якими б хорошими не були речі, деякі злі люди просто ніколи не будуть щасливі, вони ніколи не будуть задоволені.

source: You know, the red letter Bible is straight for the red letters.
uk: Ви знаєте, Біблія з червоними літерами підходить саме для червоних літер.

source: You know, we gotta move everything up and okay, this is Gog and Magog now.
uk: Знаєш, ми повинні все перенести, і добре, зараз це Гог і Магог.

source: You know, you're not even gonna worry about locking your front door probably in the millennium because things are gonna be so calm and peaceful.
uk: Ви знаєте, ви навіть не будете турбуватися про те, щоб замкнути свої вхідні двері, ймовірно, у тисячолітті, тому що все буде таким спокійним і мирним.

source: You remember how the car dealerships, I don't know, do they ever have that here in Prescott Valley, the hail sale or no?
uk: Ви пам’ятаєте, як у автосалонах, я не знаю, у них коли-небудь таке було тут, у Прескотт-Веллі, розпродаж чи ні?

source: You say, Pastor Anderson, this is pretty deep stuff.
uk: Ви скажете, пастор Андерсон, це досить глибокі речі.

source: You say, why would anyone wanna rebel against that if it's so prosperous and all this great technology, abundance of good food and everybody's doing good?
uk: Ви скажете, навіщо комусь бунтувати проти цього, якщо воно таке процвітаюче, і всі ці чудові технології, велика кількість смачної їжі, і всі роблять добре?

source: You see, even the Old Testament saints were still in Christ.
uk: Бачите, навіть старозавітні святі все ще були у Христі.

source: You see, the reality is that we do not go directly from the millennium to the great white throne and then directly to the new heaven and the new earth because of the fact that when the thousand years are expired, what does expired mean?
uk: Розумієте, реальність така, що ми не переходимо безпосередньо від тисячоліття до великого білого престолу, а потім прямо до нового неба та нової землі через той факт, що коли тисяча років минула, що означає минула?

source: You want the details, you gotta go back to where?
uk: Тобі потрібні деталі, ти маєш повернутися куди?

source: You'd actually just take it for what it said.
uk: Ви б просто сприйняли це за те, що там сказано.

source: You're going to need all the weapons that you can get because of all the looting and all the bad things that are going to be going on.
uk: Вам знадобиться вся зброя, яку ви можете отримати через усі грабунки та всі погані речі, які відбуватимуться.

source: You're gonna get confused and start killing their own allies.
uk: Ти заплутаєшся і почнеш вбивати своїх же союзників.

source: You're gonna read those over and over again.
uk: Ви будете перечитувати їх знову і знову.

source: You're never gonna run the amount that you need to run.
uk: Ви ніколи не запустите стільки, скільки потрібно.

source: You're not burning weapons, you're loading the weapons, you're cleaning your weapons, you're using them.
uk: Ви не спалюєте зброю, ви заряджаєте зброю, ви чистите свою зброю, ви її використовуєте.

source: You're not gonna get the whole picture, okay.
uk: Ви не отримаєте повної картини, гаразд.
